app/views/users/show.html.erb

SELECT  "comments".* FROM "comments"  WHERE "comments"."user_id" = ?  ORDER BY "comments"."id" ASC LIMIT 1  [["user_id", 4]]
SELECT COUNT(*) FROM "comments"  WHERE "comments"."user_id" = ?  [["user_id", 1]]
---
<h1 style="text-align:center; margin:100px; margin-bottom:20px;"><%= @user.name if @user.name %></h1>
<h4 style="text-align:center; margin:100px; margin-top:20px;"><%= @user.comments.count %> comments posted</h4>