app/controllers/comments_controller.rb

	def create
		@comment = Comment.new
		@comment.content = params[:comment][:content]
		@comment.instructor = params[:comment][:instructor]
		@comment.semester = params[:comment][:semester]
		@comment.course_id = params[:comment][:course_id]
		@course = Course.find(params[:comment][:course_id])
		if current_user == nil
      		flash[:error] = "You should sign in first"
      		redirect_to(@course)
      		return
      	else
      		@comment.user = current_user
    	end
		if @comment.save
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "course_id", "created_at", "instructor", "semester", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "aaa"], ["course_id", 1], ["created_at", "2015-04-28 06:05:04.556755"], ["instructor", "aaa"], ["semester", "aaa"], ["updated_at", "2015-04-28 06:05:04.556755"]]

	def destroy
		comment = Comment.find(params[:id])
		comment.delete
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = 3