app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."course_id" = 1 LIMIT 1
SELECT  "coursefollows".* FROM "coursefollows"  WHERE "coursefollows"."followed_course_id" = 2 AND "coursefollows"."follower_id" = 1  ORDER BY "coursefollows"."id" ASC LIMIT 1
SELECT  "follows".* FROM "follows"  WHERE "follows"."followed_course" = 2 AND "follows"."follower_id" = 1  ORDER BY "follows"."id" ASC LIMIT 1
---
	def show
		@course = Course.find(params[:id])
		@comments = Comment.where("course_id = ?", params[:id])
        @follow = Coursefollow.where(followed: @course, follower: current_user).first

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
---
	def update
		@course = Course.find(params[:id])

INSERT INTO "courses" ("courseNumber", "created_at", "department", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["courseNumber", ""], ["created_at", "2015-04-29 10:11:18.661848"], ["department", ""], ["description", ""], ["title", ""], ["updated_at", "2015-04-29 10:11:18.661848"]]
---
	def create
		@course = Course.new
		@course.courseNumber = params[:course][:courseNumber]
		@course.title = params[:course][:title]
		@course.department = params[:course][:department]
		@course.description = params[:course][:description]
		if @course.save

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 19]]
DELETE FROM "courses" WHERE "courses"."id" = 19
---
	def destroy
		course = Course.find(params[:id])
		course.delete