app/controllers/coursefollows_controller.rb

	def create
		followed = Course.find(params[:course_id])
		follower = current_user
		Coursefollow.create(follower: follower, followed: followed)
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "coursefollows" ("created_at", "followed_course_id", "follower_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-04-29 11:28:14.119147"], ["followed_course_id", 2], ["follower_id", 1], ["updated_at", "2015-04-29 11:28:14.119147"]]

	def destroy
		follow = Coursefollow.find(params[:id])
		follow.delete
---
SELECT  "coursefollows".* FROM "coursefollows"  WHERE "coursefollows"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "coursefollows" WHERE "coursefollows"."id" = 1