app/controllers/follows_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 4  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "follows" ("created_at", "followed_id", "follower_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-04-28 09:18:53.347981"], ["followed_id", 3], ["follower_id", 4], ["updated_at", "2015-04-28 09:18:53.347981"]]
---
	def create
		followed = User.find(params[:user_id])
		follower = current_user
		Follow.create(follower: follower, followed: followed)

SELECT  "follows".* FROM "follows"  WHERE "follows"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "follows" WHERE "follows"."id" = 1
---
	def destroy
		follow = Follow.find(params[:id])
		follow.delete