app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @follow = Follow.where(followed: @user, follower: current_user).first
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "follows".* FROM "follows"  WHERE "follows"."followed_id" = 3 AND "follows"."follower_id" = 4  ORDER BY "follows"."id" ASC LIMIT 1